package cargo;

// Интерфейс для чего-то маленького. Отсутствует реализация методов -> методы реализует наследник
// Поля прописываемые в интерфейсе автоматически становятся final(const)
// is-a(наследование) - у тех же машин реализация движения разная, но can-do(интерфейсы) - имеют вес

// Короче интерфейс говорит - любой класс должен иметь эти методы, которые указали, не зная точного типа объекта
// Также - класс может наследоваться(is-a) только от одного класса, но при этом интерфейс(can-do) позволяет реализовывать
// сколько угодно интерфейсов(то есть подключать к себе сколько угодно методов, которые будут реализовываться у наследника)

/*Наследование (extends, «is-a» — является): Передает код, данные (поля) и общую суть.
Создает жесткую иерархию (например: Truck — это разновидность Vehicle).
То есть можно наследоваться только от одного класса.

Интерфейс (implements, «can-do» — умеет что-то делать):
Передает только пустые методы-контракты (без полей и готового кода).
Говорит, что объект обладает определенным поведением.
Класс может реализовывать сколько угодно интерфейсов сразу.
*/

public interface ICargo {
    // автоматически модификатор доступа public
    double getWeight();
    String getType();

}
